## Staging: alarms
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 5 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                               NAME                                |
|--------|-------------------------------------------------------------------|
| add    | `aws_cloudwatch_log_subscription_filter.api_error_detection[0]`   |
|        | `aws_cloudwatch_metric_alarm.api_cpu_utilization_high_warn[0]`    |
|        | `aws_cloudwatch_metric_alarm.api_lb_unhealthy_host_count[0]`      |
|        | `aws_cloudwatch_metric_alarm.api_memory_utilization_high_warn[0]` |
|        | `aws_cloudwatch_metric_alarm.api_response_time_warn[0]`           |
| update | `aws_iam_role_policy.athena_dynamodb_policy`                      |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_log_subscription_filter.api_error_detection[0] will be created
  + resource "aws_cloudwatch_log_subscription_filter" "api_error_detection" {
      + destination_arn = "arn:aws:lambda:ca-central-1:687401027353:function:notify-slack"
      + distribution    = "ByLogStream"
      + filter_pattern  = "level=error"
      + id              = (known after apply)
      + log_group_name  = "/aws/ecs/Forms/form-api"
      + name            = "error_detection_in_api_logs"
      + role_arn        = (known after apply)
    }

  # aws_cloudwatch_metric_alarm.api_cpu_utilization_high_warn[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "api_cpu_utilization_high_warn" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:687401027353:alert-warning",
        ]
      + alarm_description                     = "API ECS Warning - High CPU usage has been detected."
      + alarm_name                            = "API-CpuUtilizationWarn"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "Forms"
          + "ServiceName" = "form-api"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:687401027353:alert-ok",
        ]
      + period                                = 120
      + statistic                             = "Average"
      + tags_all                              = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + threshold                             = 50
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.api_lb_unhealthy_host_count[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "api_lb_unhealthy_host_count" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:687401027353:alert-warning",
        ]
      + alarm_description                     = "API LB Warning - unhealthy host count >= 1 in a 1 minute period"
      + alarm_name                            = "API-UnhealthyHostCount"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "LoadBalancer" = "app/form-viewer/5e6bc2d9ab810b68"
          + "TargetGroup"  = "targetgroup/form-api/bb1e4c676d21e4a0"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "UnHealthyHostCount"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:687401027353:alert-ok",
        ]
      + period                                = 60
      + statistic                             = "Maximum"
      + tags_all                              = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.api_memory_utilization_high_warn[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "api_memory_utilization_high_warn" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:687401027353:alert-warning",
        ]
      + alarm_description                     = "API ECS Warning - High memory usage has been detected."
      + alarm_name                            = "API-MemoryUtilizationWarn"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "Forms"
          + "ServiceName" = "form-api"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "MemoryUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:687401027353:alert-ok",
        ]
      + period                                = 120
      + statistic                             = "Average"
      + tags_all                              = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + threshold                             = 50
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.api_response_time_warn[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "api_response_time_warn" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:687401027353:alert-warning",
        ]
      + alarm_description                     = "API LB Warning - The latency of response times from the API are abnormally high."
      + alarm_name                            = "API-ResponseTimeWarn"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 2
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 5
      + id                                    = (known after apply)
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:687401027353:alert-ok",
        ]
      + tags_all                              = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"

      + metric_query {
          + id          = "response_time"
          + return_data = true
            # (3 unchanged attributes hidden)

          + metric {
              + dimensions  = {
                  + "LoadBalancer" = "app/form-viewer/5e6bc2d9ab810b68"
                  + "TargetGroup"  = "targetgroup/form-api/bb1e4c676d21e4a0"
                }
              + metric_name = "TargetResponseTime"
              + namespace   = "AWS/ApplicationELB"
              + period      = 60
              + stat        = "Average"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_iam_role_policy.athena_dynamodb_policy will be updated in-place
  ~ resource "aws_iam_role_policy" "athena_dynamodb_policy" {
        id          = "athena_dynamodb_role:athena_dynamodb_policy"
        name        = "athena_dynamodb_policy"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                    # (1 unchanged element hidden)
                    {
                        Action   = [
                            "glue:GetTableVersions",
                            "glue:GetPartitions",
                            "glue:GetTables",
                            "glue:GetTableVersion",
                            "glue:GetDatabases",
                            "glue:GetTable",
                            "glue:GetPartition",
                            "glue:GetDatabase",
                            "glue:ListSchemas",
                            "athena:GetQueryExecution",
                            "s3:ListAllMyBuckets",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                    },
                  ~ {
                      ~ Action   = [
                            "dynamodb:DescribeTable",
                          + "dynamodb:ListTables",
                            "dynamodb:Query",
                            # (2 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                    {
                        Action   = [
                            "dynamodb:ListTables",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                    },
                    # (2 unchanged elements hidden)
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

Plan: 5 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_data_catalog.dynamodb"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_data_catalog.rds_data_catalog"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.codedeploy_sns"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notify_slack"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ELB_5xx_error_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.UnHealthyHostCount-TargetGroup1"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.UnHealthyHostCount-TargetGroup2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.alb_ddos"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api_cpu_utilization_high_warn[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api_lb_unhealthy_host_count[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api_memory_utilization_high_warn[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api_response_time_warn[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.audit_log_dead_letter_queue_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.cognito_login_outside_canada_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.cognito_signin_exceeded"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ddos_detected_forms_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ddos_detected_route53_warn[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.forms_cpu_utilization_high_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.forms_memory_utilization_high_warn"]
WARN - plan.json - main -...
```

</details>
